[
    {
        "degree": "Master of Engineering in Telecommunications",
        "institute": "National Institute of Applied Sciences of Lyon (INSA Lyon)",
        "institute_short": "INSA Lyon",
        "location": "Lyon, France",
        "duration": "2020 - Present",
        "score": "14+/20 (4.0/4.0 equivalent)",
        "description": [
            "Pursuing a Master's in Telecommunications Engineering, with a specialization in AI and Machine Learning. Currently in the final year, complemented by an apprenticeship as an AI Engineer at SLIB, BNP Paribas subsidiary.",
            "Engaged in a comprehensive curriculum covering Computer Science, Networking, and Communication Systems. Gained in-depth expertise in Computer Science in general and in AI methodologies and advanced Machine Learning techniques in particular.",
            "Top 100 out of 700 students after the first 2 years, top 5 out of 90 in 3rd year.",
            "Served as President of the Association of Vietnamese Students at INSA Lyon (AVI), leading initiatives, managing events and community outreach.",
            "Founded and led the Tech team at AVI, revolutionizing inner functionnalities using Tech and fostering a Tech community among Vietnamese students."
        ]
    },
    {
        "degree": "Baccalaurate in Mathematics",
        "institute": "Hanoi - Amsterdam High School for the Gifted",
        "institute_short": "Hanoi - Amsterdam",
        "location": "Hanoi, Vietnam",
        "duration": "2017 - 2020",
        "score": "9.8/10",
        "description": [
            "Pursued a curriculum focused heavily on advanced Mathematics.",
            "Participated in multiple Mathematics competitions. Some of the most notable achievements include: 2nd Prize in the Mathematics Olympiad for Excellent Students (2019), Golden Medal in Hanoi Open Mathmatics Competition (2018).",
            "Served as Vice President of Ams Baking Club, the biggest culinary club for Highschool students of Hanoi.",
            "Co-founder and Vice President of Food Story, a non-profit project that aims to do charity in rural areas of Vietnam and raise awareness by telling stories through food."
        ]
    }
]